; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 524204 2 3 2 7 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	infrared0 - mode
	thermograph1 - mode
	GroundStation2 - direction
	GroundStation3 - direction
	Star6 - direction
	Star1 - direction
	Star4 - direction
	Star5 - direction
	GroundStation0 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star5)
	(supports instrument2 infrared0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(pointing satellite1 Star4)
	(have_image Star7 infrared0)
	(have_image Phenomenon8 infrared0)
	(have_image Phenomenon9 infrared0)
	(have_image Planet10 infrared0)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 6
2. (turn_to satellite0 groundstation0 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 groundstation0)
   goals met: 2 of 6
3. (turn_to satellite1 groundstation0 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 groundstation0)
   goals met: 1 of 6
4. (calibrate satellite1 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 1 of 6
5. (turn_to satellite1 star7 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star7)
   goals met: 1 of 6
6. (take_image satellite1 star7 instrument2 infrared0)
   added: (have_image star7 infrared0)
   goals met: 2 of 6
7. (turn_to satellite1 planet10 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet10)
   goals met: 2 of 6
8. (take_image satellite1 planet10 instrument2 infrared0)
   added: (have_image planet10 infrared0)
   goals met: 3 of 6
9. (turn_to satellite1 phenomenon9 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 6
10. (take_image satellite1 phenomenon9 instrument2 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 4 of 6
11. (turn_to satellite1 phenomenon8 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon8)
   goals met: 4 of 6
12. (take_image satellite1 phenomenon8 instrument2 infrared0)
   added: (have_image phenomenon8 infrared0)
   goals met: 5 of 6
13. (turn_to satellite1 star4 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star4)
   goals met: 6 of 6
